# script02.py: 2番目のPythonスクリプト
# リスト(list)
x = [2025, 12, 31] 
print('x = ', x[0], x[1], x[2])
x[-1] = -10 # リストの最後に-10を上書き
print('x = ', x[0], x[1], x[2])
x.append(22) # リストに22を追加
print('x = ', x[0], x[1], x[2], x[3])

# 文字列の構造
y = 'Hellow!'
print('y = ', y)
print('y = ', y[0], y[1], y[2], y[3], y[4], y[5], y[6])
print('y = ', y[0] + y[1] + y[2] + y[3] + y[4] + y[5] + y[6])

# タプル(tuple)
z = (2025, 12, 31)
print('z = ', z[0], z[1], z[2])
# 下記はエラーになる
# z[-1] = -10 # リストの最後に-10を上書き
# 下記もエラーになる
# z.append(22) # リストに22を追加

# 辞書(dictionary)
dict = {'日本': '東京', 'アメリカ': 'ワシントン', '中国': '北京'}
print('dict["日本"] = ', dict['日本'])
print('dict["中国"] = ', dict['中国'])

# -------------------------------------
# Copyright (c) 2025 Tomonori Kouya
# All rights reserved.
# -------------------------------------
